posts.org
#+hugo_base_dir: ./
** DONE Dependency Injection in Go Microservices :dev:go:@TIL:
CLOSED: [2023-01-02 Mon 12:31]
:PROPERTIES:
:EXPORT_FILE_NAME: dependency-injection
:END:

*** Breaking the Code Coupling
Prior to adopting the Dependency Injection pattern, "unit testing" the codebase was virtually impossible, mainly due to its external dependencies (e.g. Firebase Cloud Messaging client). Since all the dependencies were tightly coupled /within/ the function that made use of it, it was necessary to initialize all the third-party dependencies in order to test a small snippet of code that I wrote.

*** Enforcing The Repository Pattern
#+begin_src go
type (
	HallService interface {
		CreateHallWithTx(
			ctx context.Context, sqlTx boil.ContextExecutor, option repositories.HallOption
		) (*models.Hall, error)
		GetHallWithTxOf(
			ctx context.Context, sqlTx boil.ContextExecutor, userID int
		) (*models.Hall, error)
	}

	HallServiceInstance struct {
		hallRepository repositories.HallRepsoitory
	}
)

func NewHallService(h repositories.HallRepository) *HallServiceInstance {
	return &HallServiceInstance{h}
}
#+end_src

*** Facilitating DI with Wire
Although DI improves code readability and eases up the testing procedure, it doesn't exactly scale well as the complexity of the dependency graph increases. Wire provides a number of key advantages compared to manual DI, or other tools like Uber's [[https://github.com/uber-go/dig][dig]]:
+ **Compile-time injection**: It's always to find any discrepancies in the dependency graph prior to running the actual application.
+ **Enhanced readability**: In many cases, there will be several /initialization groups/

